# sequencing- ნაბიჯ ნაბიჯ მიჰყვება კომპიუტერი თანმიმდევრობას 
# iteration- სრულდება სანამ გარკვეული პირობა არ შესრულდება
# selection- არჩევანი რომელსაც პროგრამა აკეტებს რაღაცა პირობის გამომდინარე
# pseudocode- შემოკლებული და გაადვილებული პროგრამირების ენა რომელსაც ინგლისურად ვიგებთ კაროჩე
# natural language- ჩვეულებრივი ენა რასაცქვია
# flowchart- ინსტრუქციის დინება

print('HEllo world')
print('Hello')
print(2)

age = 18

if age >= 18:
    print("you are an adult")
else:
    print("you are a minor")


fruits = ["apple" "banana" "cherry"]

for fruit in fruits:
    print(fruit)


# იყლიყოს მომზადების ეტაპები
# 1. ინგრედიენტების მომზადება
# საჭიროა:
# ფქვილი
# წყალი (თბილი)
# მარილი
# ცოტა ჭვავის ან ხორბლის საფუვარი (ან ტრადიციული მაწონი/ძირისი)
# სურვილისამებრ: ზეთი (უმეტესად უშველოდ კეთდება)
# 2. ცომის მოზელა
# დიდ ჯამში ჩაყარე ფქვილი.
# დაამატე მარილი.
# თბილ წყალში გახსენი საფუვარი (ან მაწონი).
# წყალი ნელა ჩამოასხი ფქვილში და მოზილე რბილი, არაჯიუტი ცომი.
# გააჩერე 30–60 წუთი, რომ ოდნავ ამოვიდეს.
# 3. ცომის გარშლა პატარა „ყიყლიყოებად“
# გამოდევნე ამოსული ცომი მაგიდაზე.
# ხელით ან გაბრტყელებლით ჩამოატარე მსუბუქი სქელი ფირფიტა.
# პატარა მოსჭრელი ფორმით (ან ჭიქით) გააკეთე მრგვალი, პატარა ცომის ნაჭრები.
# თითოეული ოდნავ გააბრტყელე — ზუსტად რომ იყოს პატარა, სქელი, მრგვალი პურის ფორმის.
# 4. გამოცხობა
# ორი ტრადიციული ვარიანტია:
# ა) ტაფაზე გამოცხობა
# ცხელი მშრალი ტაფა გაახურე.
# თითოეული ცომი დაალაგე.
# ორივე მხარე მოყავისფოებულამდე შეწვი.
# ბ) ღუმელში გამოცხობა
# ღუმელი გაახურე ~220°C-მდე.
# პატარა პურები დაალაგე საცხობ ფირფიტაზე.
# 10–15 წუთი აცხვე, სანამ ოქროსფერი გახდება.
# 5. გაციება და მიწოდება
# გამოდგება როგორც საჭმლის შემომდგმელი პური, ასევე სუფრასთან მისაყოლებელი.
# ზოგჯერ ცხელს ზემოდან კარაქს უსვამენ.